In [2]:
import pandas as pd
import numpy as np

# 1. A soma cumulativa de uma coluna no DataFrame

In [3]:
df = pd.DataFrame([["A", 1],
                   ["B", 2],
                   ["C", 3],
                   ["D", 4]], columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [4]:
df['col_B'].sum()

np.int64(10)

In [5]:
df['col_C'] = df['col_B'].cumsum()

In [6]:
df

  col_A  col_B  col_C
0     A      1      1
1     B      2      3
2     C      3      6
3     D      4     10

# 2. Numeração exclusiva por grupo individual no Pandas GroupBy

In [7]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["A", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     A      3
3     D      4

In [8]:
## inicie o seu código abaixo
#new_df = df.groupby("col_A").grouper.group_info[0]
df["group_num"] = df.groupby("col_A").cumcount() + 1
## termine aqui o seu código

In [9]:
df

  col_A  col_B  group_num
0     A      1          1
1     B      2          1
2     A      3          2
3     D      4          1

# 3. Verificar se a coluna tem valores NaN

In [10]:
df = pd.DataFrame([["A", np.nan], ["A", 2], ["C", np.nan], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A    NaN
1     A    2.0
2     C    NaN
3     D    4.0

In [11]:
## inicie o seu código abaixo
col_A_check = df['col_A'].hasnans
col_B_check = df['col_B'].hasnans
## termine aqui o seu código

In [12]:
col_A_check, col_B_check

(False, True)

# 4. Adicionar uma lista como uma linha a um DataFrame

In [13]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [14]:
new_row = ["E", 5]

In [15]:
df.shape[0]

4

In [16]:
## inicie o seu código abaixo
#new_df = pd.concat([df, pd.DataFrame([new_row], columns=df.columns)], ignore_index=True)
df.loc[df.shape[0]] = new_row
## termine aqui o seu código

In [17]:
df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4
4     E      5

# 5. Criar uma primeira linha com cada valor único numa coluna

In [18]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["A", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     A      3
3     D      4

In [19]:
## inicie o seu código abaixo
new_df = df.groupby('col_A').first()
## termine aqui o seu código

In [20]:
new_df

       col_B
col_A
A          1
B          2
D          4

# 6. Identificar a origem de cada linha no Pandas Merge

In [21]:
df1 = pd.DataFrame([["A", 1], ["B", 2]], 
                  columns=["col_A", "col_B"])

df2 = pd.DataFrame([["A", 3], ["C", 4]], 
                  columns=["col_A", "col_C"])

df1

  col_A  col_B
0     A      1
1     B      2

In [22]:
df2

  col_A  col_C
0     A      3
1     C      4

In [23]:
## inicie o seu código abaixo
df = pd.merge(df1, df2, how="left", indicator=True)
## termine aqui o seu código

In [24]:
df

  col_A  col_B  col_C     _merge
0     A      1    3.0       both
1     B      2    NaN  left_only

# 7. Filtrar n-maiores (n-largest) e n-menores (n-smallest) valores de um DataFrame

In [25]:
df = pd.DataFrame([["A", 200], ["B", 400],
                   ["C", 100], ["D", 300]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A    200
1     B    400
2     C    100
3     D    300

In [26]:
k = 2

In [27]:
## inicie o seu código abaixo
largest_k = df.nlargest(n=k, columns='col_B')
## termine aqui o seu código

In [28]:
largest_k

  col_A  col_B
1     B    400
3     D    300

In [29]:
## inicie o seu código abaixo
smallest_k = df.nsmallest(n=k, columns='col_B')
## termine aqui o seu código

In [30]:
smallest_k

  col_A  col_B
2     C    100
0     A    200

# 8. Mapear dados categóricos para valores integrais únicos

In [31]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["A", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     A      3
3     D      4

In [32]:
## inicie o seu código abaixo
df['new_col'] = pd.factorize( df['col_A'])[0]
## termine aqui o seu código

In [33]:
df

  col_A  col_B  new_col
0     A      1        0
1     B      2        1
2     A      3        0
3     D      4        2

# 9. Adicionar prefixo a cada nome de coluna

In [34]:
df = pd.DataFrame([["A", 1], ["B", 2],
                   ["C", 3], ["D", 4]], 
                  columns=["col_A", "col_B"])

df

  col_A  col_B
0     A      1
1     B      2
2     C      3
3     D      4

In [35]:
## inicie o seu código abaixo
new_df = df.add_prefix('pre_')
## termine aqui o seu código

In [36]:
new_df

  pre_col_A  pre_col_B
0         A          1
1         B          2
2         C          3
3         D          4

# 10. Converter colunas categóricas em valores importantes (hot values)

In [37]:
df = pd.DataFrame([["A"], ["B"],
                   ["C"], ["A"]], 
                  columns=["col_A"])

df

  col_A
0     A
1     B
2     C
3     A

In [38]:
## inicie o seu código abaixo
new_df = pd.get_dummies(df ['col_A'])
## termine aqui o seu código

In [39]:
new_df

       A      B      C
0   True  False  False
1  False   True  False
2  False  False   True
3   True  False  False